Revit 2026 API
GeometryCreationUtilities.CreateSweptBlendGeometry Method
Overload List
Name | Description
CreateSweptBlendGeometry(Curve, IList<Double>, IList<CurveLoop>, IList<ICollection<VertexPair>>)
CreateSweptBlendGeometry(Curve, IList<Double>, IList<CurveLoop>, IList<ICollection<VertexPair>>, SolidOptions)
Top
See Also
Reference
GeometryCreationUtilities Class
Autodesk.Revit.DB Namespace